nxp-mcuxpresso/mcux-soc-svd/LPC5534/LPC5534.xml
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMA1_OTRIG_INMUX[%s]</name>
          <description>DMA1 output trigger selection for DMA1 input trigger</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>SDMA1_CH_TRIGOUT</name>
              <description>DMA trigger output number (binary value) for DMA channel n (n = 0 to 15).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>SDMA1_CH0_TRIGOUT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>SDMA1_CH1_TRIGOUT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>SDMA1_CH2_TRIGOUT</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>SDMA1_CH3_TRIGOUT</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>SDMA1_CH4_TRIGOUT</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>SDMA1_CH5_TRIGOUT</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>SDMA1_CH6_TRIGOUT</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>SDMA1_CH7_TRIGOUT</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>SDMA1_CH8_TRIGOUT</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>SDMA1_CH9_TRIGOUT</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>SDMA1_CH10_TRIGOUT</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>SDMA1_CH11_TRIGOUT</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>SDMA1_CH12_TRIGOUT</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>SDMA1_CH13_TRIGOUT</description>
                  <value>0xD</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSCMP0_TRIG</name>
          <description>Input connections for HSCMP0</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>CMP0 input trigger</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>PIN_INT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>PIN_INT6</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>SCT_OUT4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>SCT_OUT5</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>SCT_OUT6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>T0_MAT3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>T1_MAT3</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>T2_MAT3</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>T0_MAT0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>T4_MAT0</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>ARM_TXEV</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>GPIOINT_BMATCH</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>ADC0_tcomp[0]</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>ADC1_tcomp[0]</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>PWM0_SM0_MUX_TRIG0 | PWM0_SM0_MUX_TRIG1</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>PWM0_SM1_MUX_TRIG0 | PWM0_SM1_MUX_TRIG1</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>PWM0_SM2_MUX_TRIG0 | PWM0_SM2_MUX_TRIG1</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>PWM0_SM3_MUX_TRIG0 | PWM0_SM3_MUX_TRIG1</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>PWM1_SM0_MUX_TRIG0 | PWM1_SM0_MUX_TRIG1</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>PWM1_SM1_MUX_TRIG0 | PWM1_SM1_MUX_TRIG1</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>PWM1_SM2_MUX_TRIG0 | PWM1_SM2_MUX_TRIG1</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>PWM1_SM3_MUX_TRIG0 | PWM1_SM3_MUX_TRIG1</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>ENC0_CMP/POS_MATCH</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>ENC1_CMP/POS_MATCH</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>AOI0_OUT0</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>AOI0_OUT1</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>AOI0_OUT2</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>AOI0_OUT3</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>AOI1_OUT0</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>AOI1_OUT1</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>AOI1_OUT2</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>AOI1_OUT3</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>DMA0_TRIGOUT0</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>DMA0_TRIGOUT1</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>DMA0_TRIGOUT2</description>
                  <value>0x25</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
