nxp-mcuxpresso/mcux-soc-svd/LPC5534/LPC5534.xml
        <register>
          <name>DCDC0</name>
          <description>DCDC (first) control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30C4E68</resetValue>
          <resetMask>0x7FFFFFF</resetMask>
          <fields>
            <field>
              <name>RC</name>
              <description>Constant On-Time calibration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICOMP</name>
              <description>Select the type of ZCD comparator.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISEL</name>
              <description>Alter Internal biasing currents.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICENABLE</name>
              <description>Selection of auto scaling of COT period with variations in VDD.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMOS</name>
              <description>One-shot generator reference current trimming signal.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLEISENSE</name>
              <description>Disable Current sensing.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOUT</name>
              <description>Set output regulation voltage.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_DCDC_0P950</name>
                  <description>0.95 V.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_0P975</name>
                  <description>0.975 V.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P000</name>
                  <description>1 V.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P025</name>
                  <description>1.025 V.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P050</name>
                  <description>1.05 V.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P075</name>
                  <description>1.075 V.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P100</name>
                  <description>1.1 V.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P125</name>
                  <description>1.125 V.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P150</name>
                  <description>1.15 V.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P175</name>
                  <description>1.175 V.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P200</name>
                  <description>1.2 V.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLICINGENABLE</name>
              <description>Enable staggered switching of power switches.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDUCTORCLAMPENABLE</name>
              <description>Enable shorting of Inductor during PFM idle time.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOUT_PWD</name>
              <description>Set output regulation voltage during Deep Sleep.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDC1</name>
          <description>DCDC (second) control register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1803A98</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTRIMOFFET</name>
              <description>Adjust the offset voltage of BJT based comparator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSENSETRIM</name>
              <description>Adjust Max inductor peak current limiting.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTESTENABLE</name>
              <description>Enable Digital test signals.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETCURVE</name>
              <description>Bandgap calibration parameter.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETDC</name>
              <description>Bandgap calibration parameter.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTESTSEL</name>
              <description>Select the output signal for test.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISCALEENABLE</name>
              <description>Modify COT behavior.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEBYPASS</name>
              <description>Force bypass mode.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMAUTOCOT</name>
              <description>Change the scaling ratio of the feedforward compensation.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEFULLCYCLE</name>
              <description>Force full PFM PMOS and NMOS cycle.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCENABLE</name>
              <description>Change the range of the peak detector of current inside the inductor.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOFF</name>
              <description>Constant Off-Time calibration input.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOFFENABLE</name>
              <description>Enable Constant Off-Time feature.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOPMU</name>
          <description>LDO control</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x109CF18</resetValue>
          <resetMask>0x31FFFFF</resetMask>
          <fields>
            <field>
              <name>VADJ</name>
              <description>Sets the Always-On domain LDO output level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_1P220</name>
                  <description>1.22 V.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P700</name>
                  <description>0.7 V.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P725</name>
                  <description>0.725 V.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P750</name>
                  <description>0.75 V.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P775</name>
                  <description>0.775 V.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P800</name>
                  <description>0.8 V.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P825</name>
                  <description>0.825 V.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P850</name>
                  <description>0.85 V.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P875</name>
                  <description>0.875 V.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P900</name>
                  <description>0.9 V.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P960</name>
                  <description>0.96 V.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P970</name>
                  <description>0.97 V.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P980</name>
                  <description>0.98 V.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_0P990</name>
                  <description>0.99 V.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P000</name>
                  <description>1 V.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P010</name>
                  <description>1.01 V.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P020</name>
                  <description>1.02 V.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P030</name>
                  <description>1.03 V.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P040</name>
                  <description>1.04 V.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P050</name>
                  <description>1.05 V.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P060</name>
                  <description>1.06 V.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P070</name>
                  <description>1.07 V.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P080</name>
                  <description>1.08 V.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P090</name>
                  <description>1.09 V.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P100</name>
                  <description>1.1 V.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P110</name>
                  <description>1.11 V.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P120</name>
                  <description>1.12 V.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P130</name>
                  <description>1.13 V.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P140</name>
                  <description>1.14 V.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P150</name>
                  <description>1.15 V.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P160</name>
                  <description>1.16 V.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P220_1</name>
                  <description>1.22 V.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADJ_PWD</name>
              <description>Sets the Always-On domain LDO output level in all power down modes.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADJ_BOOST</name>
              <description>Sets the Always-On domain LDO Boost output level.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADJ_BOOST_PWD</name>
              <description>Sets the Always-On domain LDO Boost output level in all power down modes.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
