nxp-mcuxpresso/mcux-soc-svd/LPC5534/LPC5534.xml
        <register>
          <name>PDRUNCFG1</name>
          <description>Power down run configuration 1</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>PDEN_CMPBIAS</name>
              <description>Controls power of Comparators 1/2/3 bias.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>Comparators 1/2/3 bias is powered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>Comparators 1/2/3 bias is powered down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_HSCMP0_DAC</name>
              <description>Controls power to High Speed Comparator0 DAC.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>High Speed Comparator0 DAC is powered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>High Speed Comparator0 DAC is powered down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_HSCMP1_DAC</name>
              <description>Controls power to High Speed Comparator1 DAC.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>High Speed Comparator1 DAC is powered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>High Speed Comparator1 DAC is powered down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_HSCMP2_DAC</name>
              <description>Controls power to High Speed Comparator2 DAC.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>High Speed Comparator2 DAC is powered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>High Speed Comparator2 DAC is powered down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_DAC0</name>
              <description>Controls power to DAC0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>DAC0 is powered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>DAC0 is powered down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_DAC1</name>
              <description>Controls power to DAC1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>DAC1 is powered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>DAC1 is powered down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_DAC2</name>
              <description>Controls power to DAC2.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>DAC2 is powered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>DAC2 is powered down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPEN_DAC0</name>
              <description>Controls DAC0 Stop mode.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPDISABLE</name>
                  <description>DAC0 Stop mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPENABLE</name>
                  <description>DAC0 Stop mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPEN_DAC1</name>
              <description>Controls DAC1 Stop mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPDISABLE</name>
                  <description>DAC1 Stop mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPENABLE</name>
                  <description>DAC1 Stop mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPEN_DAC2</name>
              <description>Controls DAC2 Stop mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPDISABLE</name>
                  <description>DAC2 Stop mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPENABLE</name>
                  <description>DAC2 Stop mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDRUNCFGSET0</name>
          <description>Power down run configuration set 0</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDRUNCFGSET0</name>
              <description>Writing ones to this register sets the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDRUNCFGSET1</name>
          <description>Power down run configuration set 1</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>PDRUNCFGSET1</name>
              <description>Writing ones to this register sets the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDRUNCFGCLR0</name>
          <description>Power down run configuration clear 0</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDRUNCFGCLR0</name>
              <description>Writing ones to this register clears the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDRUNCFGCLR1</name>
          <description>Power down run configuration clear 1</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>PDRUNCFGCLR1</name>
              <description>Writing ones to this register clears the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCTRL</name>
          <description>SRAM control</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>SMB</name>
              <description>Source Biasing voltage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low leakage.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>Medium leakage.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHEST</name>
                  <description>Highest leakage.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCTRL0</name>
          <description>SRAM control 0</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x66666666</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RAM_X0_LS</name>
              <description>RAM_X0 Light Sleep mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_X0_DSB</name>
              <description>RAM_X0 Deep sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_X0_DSBDEL</name>
              <description>RAM_X0 Deep sleep delayed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_X0_LSDEL</name>
              <description>RAM_X0 Sleep mode disable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_00_LS</name>
              <description>RAM_00 Light Sleep mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_00_DSB</name>
              <description>RAM_00 Deep sleep mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_00_DSBDEL</name>
              <description>RAM_00 Deep sleep delayed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_00_LSDEL</name>
              <description>RAM_00 Sleep mode disable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_01_LS</name>
              <description>RAM_01 Light Sleep mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_01_DSB</name>
              <description>RAM_01 Deep sleep mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_01_DSBDEL</name>
              <description>RAM_01 Deep sleep delayed.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_01_LSDEL</name>
              <description>RAM_01 Sleep mode disable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_02_LS</name>
              <description>RAM_02 Light Sleep mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_02_DSB</name>
              <description>RAM_02 Deep sleep mode.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_02_DSBDEL</name>
              <description>RAM_02 Deep sleep delayed.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_02_LSDEL</name>
              <description>RAM_02 Sleep mode disable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_03_LS</name>
              <description>RAM_03 Light Sleep mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_03_DSB</name>
              <description>RAM_03 Deep sleep mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_03_DSBDEL</name>
              <description>RAM_03 Deep sleep delayed.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_03_LSDEL</name>
              <description>RAM_03 Sleep mode disable.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_10_LS</name>
              <description>RAM_10 Light Sleep mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_10_DSB</name>
              <description>RAM_10 Deep sleep mode.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_10_DSBDEL</name>
              <description>RAM_10 Deep sleep delayed.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_10_LSDEL</name>
              <description>RAM_10 Sleep mode disable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_20_LS</name>
              <description>RAM_20 Light Sleep mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_20_DSB</name>
              <description>RAM_20 Deep sleep mode.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_20_DSBDEL</name>
              <description>RAM_20 Deep sleep delayed.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_20_LSDEL</name>
              <description>RAM_20 Sleep mode disable.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_30_LS</name>
              <description>RAM_30 Light Sleep mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_30_DSB</name>
              <description>RAM_30 Deep sleep mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_30_DSBDEL</name>
              <description>RAM_30 Deep sleep delayed.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAM_30_LSDEL</name>
              <description>RAM_30 Light Sleep mode delayed.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
