nxp-mcuxpresso/mcux-soc-svd/LPC5534/LPC5534.xml
        <register>
          <name>INTENCLR0</name>
          <description>Interrupt Enable Clear for all DMA channels</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CLR0</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR1</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR2</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR3</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR4</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR5</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR6</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR7</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR8</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR9</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR10</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR11</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR12</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR13</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR14</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR15</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR16</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR17</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR18</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR19</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR20</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR21</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR22</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR23</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR24</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR25</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR26</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR27</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR28</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR29</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR30</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR31</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR1</name>
          <description>Interrupt Enable Clear for all DMA channels</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CLR32</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR33</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR34</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR35</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR36</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR37</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR38</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR39</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR40</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR41</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR42</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR43</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR44</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR45</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR46</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR47</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR48</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR49</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR50</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLR51</name>
              <description>Writing ones to this register clears corresponding bits in the DMAIntEnSet1.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
