nxp-mcuxpresso/mcux-soc-svd/LPC5534/LPC5534.xml
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRP30</name>
              <description>Selects pin direction for pin PIOa_b.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIR_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIR_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRP31</name>
              <description>Selects pin direction for pin PIOa_b.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIR_0</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIR_1</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK0</name>
          <description>Port mask</description>
          <addressOffset>0x2080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MASKP0</name>
              <description>Port Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP1</name>
              <description>Port Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP2</name>
              <description>Port Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP3</name>
              <description>Port Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP4</name>
              <description>Port Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP5</name>
              <description>Port Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP6</name>
              <description>Port Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP7</name>
              <description>Port Mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP8</name>
              <description>Port Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP9</name>
              <description>Port Mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP10</name>
              <description>Port Mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP11</name>
              <description>Port Mask</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP12</name>
              <description>Port Mask</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP13</name>
              <description>Port Mask</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP14</name>
              <description>Port Mask</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP15</name>
              <description>Port Mask</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP16</name>
              <description>Port Mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP17</name>
              <description>Port Mask</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP18</name>
              <description>Port Mask</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP19</name>
              <description>Port Mask</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP20</name>
              <description>Port Mask</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP21</name>
              <description>Port Mask</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP22</name>
              <description>Port Mask</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP23</name>
              <description>Port Mask</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP24</name>
              <description>Port Mask</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP25</name>
              <description>Port Mask</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP26</name>
              <description>Port Mask</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKP_1</name>
                  <description>Read MPIN: 0; write MPIN: output bit not affected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASKP27</name>
              <description>Port Mask</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKP_0</name>
                  <description>Read MPIN: pin state; write MPIN: load output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
