nxp-mcuxpresso/mcux-soc-svd/LPC5534/LPC5534.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="HSCMP0">
      <name>HSCMP1</name>
      <description>HSCMP</description>
      <groupName>HSCMP</groupName>
      <baseAddress>0x400B7000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x3C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HSCMP1</name>
        <value>78</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="HSCMP0">
      <name>HSCMP2</name>
      <description>HSCMP</description>
      <groupName>HSCMP</groupName>
      <baseAddress>0x400BA000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x3C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HSCMP2</name>
        <value>79</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>OPAMP0</name>
      <description>OPAMP</description>
      <groupName>OPAMP</groupName>
      <headerStructName>OPAMP</headerStructName>
      <baseAddress>0x400B4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PGA_FUNCTION</name>
              <description>PGA Function Option</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Core amplifier is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>PGA function is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPAMP_CTR</name>
          <description>OPAMP control register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>OPAMP Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_0</name>
                  <description>OPAMP is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_1</name>
                  <description>OPAMP is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low noise mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High speed mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIASC</name>
              <description>Bias Current Trim Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>def</name>
                  <description>Default.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>incr</name>
                  <description>Increase current.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>decr</name>
                  <description>Decrease current.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>decr1</name>
                  <description>Further decrease current.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTREF</name>
              <description>Internal Reference Voltage Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vdda_2</name>
                  <description>Select vdda/2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vdda_3</name>
                  <description>Select vdda_3v.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vssa_3</name>
                  <description>Select vssa_3v.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Res</name>
                  <description>Not allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSW</name>
              <description>ADC Channel Switch</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREF</name>
              <description>Positive Reference Voltage Selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vref3</name>
                  <description>Select vrefh3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref0</name>
                  <description>Select vrefh0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref1</name>
                  <description>Select vrefh1.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAIN</name>
              <description>Positive PGA Selection.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ratio1</name>
                  <description>Ratio 1:1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio2</name>
                  <description>Ratio 1:2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio3</name>
                  <description>Ratio 1:4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio4</name>
                  <description>Ratio 1:8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio5</name>
                  <description>Ratio 1:16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio6</name>
                  <description>Ratio 1:33</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio7</name>
                  <description>Ratio 1:64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NGAIN</name>
              <description>Negative PGA selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>buf</name>
                  <description>Buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio1</name>
                  <description>Ratio 1:1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio2</name>
                  <description>Ratio 1:2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio3</name>
                  <description>Ratio 1:4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio4</name>
                  <description>Ratio 1:8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio5</name>
                  <description>Ratio 1:16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio6</name>
                  <description>Ratio 1:33</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ratio7</name>
                  <description>Ratio 1:64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
