nxp-mcuxpresso/mcux-soc-svd/LPC5534/LPC5534.xml
        <register>
          <name>POSDPERH</name>
          <description>Position Difference Period Hold Register</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>POSDPERH</name>
              <description>Position difference period hold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL3</name>
          <description>Control 3 Register</description>
          <addressOffset>0x32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PMEN</name>
              <description>Period measurement function enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTUSED</name>
                  <description>Period measurement functions are not used. POSD is loaded to POSDH and then cleared whenever POSD, UPOS, LPOS, or REV is read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USED</name>
                  <description>Period measurement functions are used. POSD is loaded to POSDH and then cleared only when POSD is read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSC</name>
              <description>Prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="ENC0">
      <name>ENC1</name>
      <description>ENC</description>
      <groupName>ENC</groupName>
      <baseAddress>0x400C6000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ENC1_COMPARE</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>ENC1_HOME</name>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>ENC1_WDG</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>ENC1_IDX</name>
        <value>109</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>AOI0</name>
      <description>AOI</description>
      <groupName>AOI</groupName>
      <headerStructName>AOI</headerStructName>
      <baseAddress>0x400C7000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BFCRT010</name>
          <description>Boolean Function Term 0 and 1 Configuration Register for EVENTn</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PT1_DC</name>
              <description>Product term 1, D input configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT1_DC_0</name>
                  <description>Force the D input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_DC_1</name>
                  <description>Pass the D input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_DC_2</name>
                  <description>Complement the D input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_DC_3</name>
                  <description>Force the D input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT1_CC</name>
              <description>Product term 1, C input configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT1_CC_0</name>
                  <description>Force the C input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_CC_1</name>
                  <description>Pass the C input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_CC_2</name>
                  <description>Complement the C input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_CC_3</name>
                  <description>Force the C input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT1_BC</name>
              <description>Product term 1, B input configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT1_BC_0</name>
                  <description>Force the B input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_BC_1</name>
                  <description>Pass the B input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_BC_2</name>
                  <description>Complement the B input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_BC_3</name>
                  <description>Force the B input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT1_AC</name>
              <description>Product term 1, A input configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT1_AC_0</name>
                  <description>Force the A input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_AC_1</name>
                  <description>Pass the A input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_AC_2</name>
                  <description>Complement the A input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_AC_3</name>
                  <description>Force the A input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_DC</name>
              <description>Product term 0, D input configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT0_DC_0</name>
                  <description>Force the D input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_DC_1</name>
                  <description>Pass the D input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_DC_2</name>
                  <description>Complement the D input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_DC_3</name>
                  <description>Force the D input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_CC</name>
              <description>Product term 0, C input configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT0_CC_0</name>
                  <description>Force the C input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_CC_1</name>
                  <description>Pass the C input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_CC_2</name>
                  <description>Complement the C input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_CC_3</name>
                  <description>Force the C input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_BC</name>
              <description>Product term 0, B input configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT0_BC_0</name>
                  <description>Force the B input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_BC_1</name>
                  <description>Pass the B input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_BC_2</name>
                  <description>Complement the B input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_BC_3</name>
                  <description>Force the B input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_AC</name>
              <description>Product term 0, A input configuration</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT0_AC_0</name>
                  <description>Force the A input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_AC_1</name>
                  <description>Pass the A input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_AC_2</name>
                  <description>Complement the A input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_AC_3</name>
                  <description>Force the A input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
